Host object contains too many cutting inserts - it may take long time to update. Consider splitting host object into smaller pieces or using stacked walls.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId HostHasTooManyInserts { get; }
  Visual Basic
Public Shared ReadOnly Property HostHasTooManyInserts As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ HostHasTooManyInserts {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PerformanceFailures Class
  Autodesk.Revit.DB Namespace